In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
seri=pd.Series([1,2,3,4,5])

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [6]:
seri.dtype

dtype('int64')

In [7]:
seri.size

5

In [8]:
seri.ndim

1

In [9]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [10]:
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
pd.Series([11,452,344,423,54],index = [1,3,5,9,7])

1     11
3    452
5    344
9    423
7     54
dtype: int64

In [12]:
seri=pd.Series([99,22,332,94,5],index=["a","b","c","d","e"])

In [13]:
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

In [14]:
# Sözlük üzerinden liste oluşturmak

In [15]:
sozluk = pd.Series({"reg":10 , "log" : 11 ,"cart":12})

In [16]:
sozluk

reg     10
log     11
cart    12
dtype: int64

In [17]:
pd.concat([sozluk,sozluk])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [18]:
a = np.array([1,2,33,444,75])

In [19]:
seri = pd.Series(a)

In [20]:
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [21]:
seri[0]

1

In [22]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [23]:
seri = pd.Series([121,200,150,99],index=["reg","loj","cart","rf"])

In [24]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [25]:
seri["reg"]

121

In [26]:
list(seri.keys())

['reg', 'loj', 'cart', 'rf']

In [27]:
"reg" in seri

True

In [28]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [29]:
seri["reg"] = 130

In [30]:
seri

reg     130
loj     200
cart    150
rf       99
dtype: int64

In [31]:
seri["reg":"cart"]

reg     130
loj     200
cart    150
dtype: int64

In [32]:
l = [1,2,39,67,90]

In [33]:
l

[1, 2, 39, 67, 90]

In [34]:
pd.DataFrame(l,columns=["değişken_ismi"])

   değişken_ismi
0              1
1              2
2             39
3             67
4             90

In [35]:
a = np.arange(1,10).reshape(3,3)

In [36]:
df=pd.DataFrame(a,columns=["column1","column2","column3"])

In [37]:
df

   column1  column2  column3
0        1        2        3
1        4        5        6
2        7        8        9

In [38]:
df.columns = ["deg1","deg2","deg3"]

In [39]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [40]:
type(df)

pandas.core.frame.DataFrame

In [41]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [42]:
df.shape

(3, 3)

In [43]:
df.ndim

2

In [44]:
df.size

9

In [45]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [46]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [47]:
a = np.array([1,2,3,4,5])

In [48]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

In [49]:
#ELeman işlemleri

In [50]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [51]:
sozluk = {"var1":s1 , "var2":s2 , "var3": s3}

In [52]:
sozluk

{'var1': array([5, 2, 7, 6, 4]),
 'var2': array([6, 8, 5, 3, 7]),
 'var3': array([1, 6, 2, 3, 5])}

In [53]:
df = pd.DataFrame(sozluk)

In [54]:
df

   var1  var2  var3
0     5     6     1
1     2     8     6
2     7     5     2
3     6     3     3
4     4     7     5

In [55]:
df.index.name ="çökertme"

In [56]:
df.index = ("a","b","c","d","e")

In [57]:
df.index.name ="çökertme"

In [58]:
df

          var1  var2  var3
çökertme
a            5     6     1
b            2     8     6
c            7     5     2
d            6     3     3
e            4     7     5

In [59]:
df["c":"e"]

          var1  var2  var3
çökertme
c            7     5     2
d            6     3     3
e            4     7     5

In [60]:
#silme

In [61]:
df.drop("a",axis=0)

          var1  var2  var3
çökertme
b            2     8     6
c            7     5     2
d            6     3     3
e            4     7     5

In [62]:
df.drop("a",axis= 0 , inplace= True)

In [63]:
df

          var1  var2  var3
çökertme
b            2     8     6
c            7     5     2
d            6     3     3
e            4     7     5

In [64]:
#fancy

In [65]:
l = ["c","e"]

In [66]:
df.drop(l,axis=0)

          var1  var2  var3
çökertme
b            2     8     6
d            6     3     3

In [67]:
"var1" in df

True

In [68]:
l = ["var1","var4","var2"]

In [69]:
for i in l:
    print(i in df)

True
False
True

In [70]:
df["var4"] = df["var1"] / df["var2"]

In [71]:
df

          var1  var2  var3      var4
çökertme
b            2     8     6  0.250000
c            7     5     2  1.400000
d            6     3     3  2.000000
e            4     7     5  0.571429

In [72]:
l = ["var1","var2"]

In [73]:
df.drop(l,axis = 1)

          var3      var4
çökertme
b            6  0.250000
c            2  1.400000
d            3  2.000000
e            5  0.571429

In [74]:
df.drop("var4",axis=1 , inplace=True)

In [75]:
df.drop(l,axis = 1)

          var3
çökertme
b            6
c            2
d            3
e            5

In [76]:
#loc

In [77]:
m = np.random.randint(1,30,size=(10,3))

In [78]:
df = pd.DataFrame(m,columns=["var1","var2","var3"])

In [79]:
df

   var1  var2  var3
0    25    22     3
1    22     7    24
2    12    29    16
3     2    23    24
4    20     8    28
5    27    26    23
6    17    20    25
7    11     8    23
8     4    26    14
9     3    20     8

In [80]:
df.loc[0:3]

   var1  var2  var3
0    25    22     3
1    22     7    24
2    12    29    16
3     2    23    24

In [81]:
#iloc

In [82]:
df.iloc[0:3]

   var1  var2  var3
0    25    22     3
1    22     7    24
2    12    29    16

In [83]:
df.iloc[0,0]

25

In [84]:
df

   var1  var2  var3
0    25    22     3
1    22     7    24
2    12    29    16
3     2    23    24
4    20     8    28
5    27    26    23
6    17    20    25
7    11     8    23
8     4    26    14
9     3    20     8

In [85]:
df.iloc[0,0]

25

In [86]:
df.iloc[:3,:2]

   var1  var2
0    25    22
1    22     7
2    12    29

In [87]:
df.loc[0:3,"var3"]

0     3
1    24
2    16
3    24
Name: var3, dtype: int32

In [88]:
df["var3"][0:3]

0     3
1    24
2    16
Name: var3, dtype: int32

In [89]:
df

   var1  var2  var3
0    25    22     3
1    22     7    24
2    12    29    16
3     2    23    24
4    20     8    28
5    27    26    23
6    17    20    25
7    11     8    23
8     4    26    14
9     3    20     8

In [90]:
df[df.var1 > 10]

   var1  var2  var3
0    25    22     3
1    22     7    24
2    12    29    16
4    20     8    28
5    27    26    23
6    17    20    25
7    11     8    23

In [91]:
a=df[df.var1 > 15]["var1"].copy()

In [92]:
df["var5"] = pd.Series(np.random.randint(1,30,size=10))

In [93]:
df

   var1  var2  var3  var5
0    25    22     3    29
1    22     7    24    16
2    12    29    16    20
3     2    23    24    13
4    20     8    28    26
5    27    26    23    17
6    17    20    25    22
7    11     8    23     2
8     4    26    14    22
9     3    20     8    19

In [94]:
df.loc[(df.var1 > 15),["var1","var2"]]

   var1  var2
0    25    22
1    22     7
4    20     8
5    27    26
6    17    20

In [95]:
m = np.random.randint(1,30,size =(5,3))
df1 = pd.DataFrame(m,columns=("var1","var2","var3"))

In [96]:
df1

   var1  var2  var3
0    15    17    16
1    16     2    25
2    19    15    24
3    18    13     3
4    27    29    23

In [97]:
df2 = df1 + 99

In [98]:
pd.concat((df1,df2),ignore_index= True)

   var1  var2  var3
0    15    17    16
1    16     2    25
2    19    15    24
3    18    13     3
4    27    29    23
5   114   116   115
6   115   101   124
7   118   114   123
8   117   112   102
9   126   128   122

In [99]:
df2.columns = ("var1","var2","deg3")

In [100]:
df2

   var1  var2  deg3
0   114   116   115
1   115   101   124
2   118   114   123
3   117   112   102
4   126   128   122

In [101]:
pd.concat([df1,df2],join="inner",ignore_index= True)

   var1  var2
0    15    17
1    16     2
2    19    15
3    18    13
4    27    29
5   114   116
6   115   101
7   118   114
8   117   112
9   126   128

In [102]:
df1 = pd.DataFrame({"calısanlar":["ali","veli","ayse","fatma"],
                   "grup":["muhasebe","muhendislik","muhendislik","ik"]})

In [103]:
df1

  calısanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [104]:
df2 = pd.DataFrame({"calısanlar":["ayse","ali","veli","fatma"],
                   "ilk_giris": [2010,2009,2014,2019]})

In [105]:
df2

  calısanlar  ilk_giris
0       ayse       2010
1        ali       2009
2       veli       2014
3      fatma       2019

In [106]:
pd.merge(df1,df2,on="calısanlar")

  calısanlar         grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      fatma           ik       2019

In [107]:
df3 = pd.merge(df1,df2)

In [108]:
df3

  calısanlar         grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      fatma           ik       2019

In [109]:
df4 = pd.DataFrame({"group":["muhasebe","muhendislik","ik"],
                   "mudur": ["caner","mustafa","berkcan"]})

In [110]:
#toplulaştırma ve gruplaştırma

In [111]:
import seaborn as sns

In [112]:
df = sns.load_dataset("planets")

In [113]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [114]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [115]:
df = pd.DataFrame({"guruplar":["A","B","C","A","B","C"],
                  "veri":[10,11,52,23,43,55]})

In [116]:
df

  guruplar  veri
0        A    10
1        B    11
2        C    52
3        A    23
4        B    43
5        C    55

In [117]:
df.groupby("guruplar").mean()

          veri
guruplar
A         16.5
B         27.0
C         53.5

In [118]:
df = sns.load_dataset("planets")

In [119]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [120]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [121]:
df.groupby("gruplar").describe()

        degisken1                                                degisken2  \
            count  mean        std   min   25%   50%   75%   max     count
gruplar
A             2.0  16.0   8.485281  10.0  13.0  16.0  19.0  22.0       2.0
B             2.0  17.0   8.485281  11.0  14.0  17.0  20.0  23.0       2.0
C             2.0  66.0  46.669048  33.0  49.5  66.0  82.5  99.0       2.0


          mean         std    min    25%    50%    75%    max
gruplar
A        181.0  114.551299  100.0  140.5  181.0  221.5  262.0
B        182.0  100.409163  111.0  146.5  182.0  217.5  253.0
C        651.0  449.719913  333.0  492.0  651.0  810.0  969.0

In [122]:
df.groupby("gruplar").aggregate(["min",np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [123]:
df.groupby("gruplar").aggregate({"degisken1": "min" , "degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [124]:
def fiter_func(x):
    return x["degisken1"].std() > 9

In [125]:
df.groupby("gruplar").filter(fiter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [126]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [133]:
df_a=df.iloc[:,1:3]

In [136]:
df_a.transform(lambda x : (x - x.mean())/ x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [138]:
df.drop("gruplar",axis=1,inplace= True)

In [139]:
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [140]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [141]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [146]:
df.groupby("gruplar").apply(sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [147]:
#pivot_table

In [149]:
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [151]:
titanic.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [162]:
titanic.groupby(["sex","class"])[["survived"]].mean().unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [163]:
# pivot ile pivot_table

In [164]:
titanic.pivot_table("survived",index= "sex",columns= "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [165]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [168]:
age = pd.cut(titanic["age"],[10,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7             NaN
8    (18.0, 90.0]
9    (10.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(10, 18] < (18, 90]]

In [169]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (10, 18]  1.000000  1.000000  0.523810
       (18, 90]  0.972973  0.900000  0.423729
male   (10, 18]  0.666667  0.000000  0.103448
       (18, 90]  0.375000  0.071429  0.133663

In [173]:
#csv okuma
pd.read_csv("ornekcsv.csv",sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [178]:
#txt
pd.read_csv("duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [179]:
?pd.read_csv

In [180]:
pd.read_excel("ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [181]:
df = pd.read_excel("ornekx.xlsx")

In [183]:
df.columns = ("A","B","C")

In [184]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0